app/views/studentsubjects/index.html.haml

=#Studentsubject.where(user_id: current_user.id).class
-#current_user.studentsubjects.each do |subject|
---
SELECT `studentsubjects`.* FROM `studentsubjects`