app/views/students/_asign_grupo.html.haml

				-#%option{:value => "WY"} Wyoming padre
			=select_tag 'student[]', options_for_select(Student.all.collect{ |u| [u.name_lastname, u.id]}),{class: "js-example-basic-single",multiple: "multiple"}
---
SELECT `students`.* FROM `students`

			=#hidden_field_tag 'grupo', 1
			=select_tag 'grupo', options_for_select(Group.all.collect{ |u| [u.name, u.id]}),{class: "form-tag"}
---
SELECT `groups`.* FROM `groups`

			Grupo >
			=stu.group.name
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]