app/views/students/_asign_materia.haml

				-#%option{:value => "WY"} Wyoming padre
			=select_tag 'student[]', options_for_select(Student.all.collect{ |u| [u.name_lastname, u.id]}),{class: "js-example-basic-single",multiple: "multiple"}
			=hidden_field_tag 'asignar', 1
			=select_tag 'materia', options_for_select(Subject.all.collect{ |u| [u.name, u.id]}),{class: "form-tag"}
---
SELECT `students`.* FROM `students`
SELECT `subjects`.* FROM `subjects`