app/views/students/_form.html.haml

    =# f.label :subject
    =# f.collection_select(:subjects, Subject.all, :id, :name,{})
  .row
    .col-md-4
      .field.form-group
---
SELECT "subjects".* FROM "subjects"