app/views/students/index.html.haml

        -#%td= student.id#check_box_tag "student_id", student.id , false , id: student.name
        -#%td= student.group.name if student.group.present?
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        %td= student.banknumber
        %td= student.semester.number_semester if student.semester.present?
---
SELECT  `semesters`.* FROM `semesters` WHERE `semesters`.`id` = 4 LIMIT 1

%br
-#Student.all.each_with_index do |val,index|
---
SELECT `students`.* FROM `students`