app/views/students/panelcontrol.html.haml

      =submit_tag "Search", name: nil, class: "btn btn-info mt-2"
-#Student.all.each_with_index do |val,index|
---
SELECT `students`.* FROM `students` WHERE (lastname LIKE '%marcial%')

      =hidden_field_tag 'asignar', 1
      =select_tag 'materia', options_for_select(Subject.all.collect{ |u| [u.name, u.id]}),{class: "form-tag"}
      =select_tag 'profesor', options_for_select(User.where(role: "professor").collect{ |u| [u.last_name, u.id]}),{class: "form-tag"}
---
SELECT `subjects`.* FROM `subjects`
SELECT `users`.* FROM `users` WHERE (role = ?, control)

      =hidden_field_tag 'asignar', 3
      =select_tag 'grupo', options_for_select(Group.all.collect{ |u| [u.name, u.id]}),{class: "form-tag"}
---
SELECT `groups`.* FROM `groups`

      =hidden_field_tag 'asignar', 2
      =select_tag 'semestre', options_for_select(Semester.all.collect{ |u| [u.number_semester, u.id]}),{class: "form-tag"}
---
SELECT `semesters`.* FROM `semesters`