app/views/students/show.html.haml

SELECT `studentsubjects`.`id` FROM `studentsubjects` WHERE `studentsubjects`.`student_id` = 1
---
  -#%b Total a pagar:
  -# @student.studentsubjects.each do |mod|