app/views/students/show.html.haml

  %b Group:
  = @student.group.name if @student.group.present?
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  -#%b Adeudos a pagar:
  -#@debt = Debt.all
---
SELECT `debts`.* FROM `debts`

  %b Materias:
  -@student.subjects.each do |materia|
---
SELECT `subjects`.* FROM `subjects` INNER JOIN `studentsubjects` ON `subjects`.`id` = `studentsubjects`.`subject_id` WHERE `studentsubjects`.`student_id` = 1