app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts`
SELECT SUM(`accounts`.`amount`) FROM `accounts`
---
  def index
    @accounts = Account.all
    @total_amounts = Account.sum(:amount)

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."student_id" = ? LIMIT ?  [["student_id", 2], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    respond_to do |format|
      if @account.present?#update(account_params)

        #Search the actual amount of the student
        @studentAccount = Student.find(params[:student_id]).account.amount.to_f

        if params[:razon].present?
          @pago = params[:amount1].to_f
          @totalDebts = @pago + @studentAccount

        elsif params[:amount_array].present?
          @mensualidad = 0
          @totalDebts = 0
          #Search  discount
          @discount = Student.find(params[:student_id]).discount.to_f

          #Get de array of amount and sum the values
          @paramsDebts = params[:amount_array]
          @paramsDebts.each do |allDebts|

            debt = Debt.find(allDebts)

INSERT INTO `recordpayments` (`user_name`, `amount`, `created_at`, `updated_at`) VALUES ('Marcial Galvan', 500, '2019-01-23 03:08:25', '2019-01-23 03:08:25')
---
          @recordpayment = Recordpayment.new
          @recordpayment.amount = @totalDebts
          @recordpayment.user_name = "#{current_user.name} #{current_user.last_name}"
          @recordpayment.save

UPDATE "accounts" SET "amount" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["amount", -2500.0], ["updated_at", "2018-10-12 04:41:16.236959"], ["id", 1]]
---

        end

        puts "***Account actualizado****" if @account.update(amount: @totalDebts)

DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]
---
  def destroy
    @account.destroy