app/controllers/debts_controller.rb

SELECT `debts`.* FROM `debts`
---
  def index
    @debts = Debt.all

INSERT INTO "debts" ("name", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Inscripción"], ["amount", -1500.0], ["created_at", "2018-10-21 23:02:01.097675"], ["updated_at", "2018-10-21 23:02:01.097675"]]
---
  def create
    @debt = Debt.new(debt_params)

    respond_to do |format|
      if @debt.save

UPDATE `debts` SET `amount` = -300.0, `updated_at` = '2019-01-18 02:08:27' WHERE `debts`.`id` = 1
---
  def update
    respond_to do |format|
      if @debt.update(debt_params)

SELECT  "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_debt
      @debt = Debt.find(params[:id])