app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT `groups`.* FROM `groups`

  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "12a"], ["created_at", "2018-10-11 04:48:00.941518"], ["updated_at", "2018-10-11 04:48:00.941518"]]