app/controllers/partials_controller.rb

SELECT "partials".* FROM "partials"
---
  def index
    @partials = Partial.all

INSERT INTO "partials" ("number_partial", "created_at", "updated_at") VALUES (?, ?, ?)  [["number_partial", 1], ["created_at", "2018-11-04 22:31:20.133754"], ["updated_at", "2018-11-04 22:31:20.133754"]]
---
  def create
    @partial = Partial.new(partial_params)

    respond_to do |format|
      if @partial.save

SELECT  "partials".* FROM "partials" WHERE "partials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_partial
      @partial = Partial.find(params[:id])