app/controllers/recordpayments_controller.rb

  def index
    @recordpayments = Recordpayment.all

    if params[:delete_records].present?
      @recordpayments.delete_all
---
SELECT `recordpayments`.* FROM `recordpayments`
DELETE FROM `recordpayments`

  def destroy
    @recordpayment.destroy
---
DELETE FROM `recordpayments` WHERE `recordpayments`.`id` = 1

    def set_recordpayment
      @recordpayment = Recordpayment.find(params[:id])
---
SELECT  `recordpayments`.* FROM `recordpayments` WHERE `recordpayments`.`id` = 1 LIMIT 1