app/controllers/semesters_controller.rb

  def index
    @semesters = Semester.all
---
SELECT `semesters`.* FROM `semesters`

  def create
    @semester = Semester.new(semester_params)

    respond_to do |format|
      if @semester.save
---
INSERT INTO `semesters` (`number_semester`, `created_at`, `updated_at`) VALUES (1, '2019-01-24 04:31:32', '2019-01-24 04:31:32')

    def set_semester
      @semester = Semester.find(params[:id])
---
SELECT  `semesters`.* FROM `semesters` WHERE `semesters`.`id` = 1 LIMIT 1