app/controllers/studentsubjects_controller.rb

SELECT `studentsubjects`.* FROM `studentsubjects`
---
  def index
    @studentsubjects = Studentsubject.all

UPDATE `studentsubjects` SET `firstsmodulescore` = 80, `updated_at` = '2019-01-18 02:54:39' WHERE `studentsubjects`.`id` = 1
---
  def update
    respond_to do |format|
      if @studentsubject.update(studentsubject_params)

SELECT  `studentsubjects`.* FROM `studentsubjects` WHERE `studentsubjects`.`id` = 1 LIMIT 1
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
    def set_studentsubject
      @studentsubject = Studentsubject.find(params[:id])