app/controllers/students_controller.rb

SELECT `students`.* FROM `students`
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "students" SET "group_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["group_id", 2], ["updated_at", "2019-01-02 08:49:19.557807"], ["id", 2]]
INSERT INTO `studentsubjects` (`subject_id`, `student_id`, `created_at`, `updated_at`) VALUES (1, 1, '2019-01-14 00:57:56', '2019-01-14 00:57:56')
---
  def assigment
    if params[:grupo].present?
      redirect_to "/asignar?asignar=#{3}"
      puts "**************************"
      puts params
      puts "**************************"
      if params[:student].present?
        params[:student].each do |id_student|
          estudiante = Student.find(id_student)
          puts estudiante.name
          puts "Actualizado el grupo" if estudiante.update(group_id: params[:grupo])
        end
      end

    elsif params[:materia].present?
      redirect_to "/asignar?asignar=#{1}"
      puts "**************************"
      puts params
      puts "**************************"
      if params[:student].present?
        params[:student].each do |id_student|
          @studentsubject = Studentsubject.new
          @studentsubject.student_id = id_student
          @studentsubject.subject_id = params[:materia]
          @studentsubject.save

SELECT `students`.* FROM `students` WHERE (lastname LIKE '%marcial%')
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
INSERT INTO `studentsubjects` (`subject_id`, `student_id`, `created_at`, `updated_at`) VALUES (1, 1, '2019-01-21 07:12:28', '2019-01-21 07:12:28')
---
  def panelcontrol
    if params[:student].present?
      @estudiante = Student.search(params[:student])
    end

    if params[:grupo].present?
      redirect_to "/panel"
      puts "**************************"
      puts params
      puts "**************************"
      if params[:student].present?
        params[:student].each do |id_student|
          estudiante = Student.find(id_student)
          puts estudiante.name
          puts "Actualizado el grupo" if estudiante.update(group_id: params[:grupo])
        end
      end

    elsif params[:materia].present?
      redirect_to "/panel"
      puts "**************************"
      puts params
      puts "**************************"
      if params[:student].present?
        params[:student].each do |id_student|
          @studentsubject = Studentsubject.new
          @studentsubject.student_id = id_student
          @studentsubject.subject_id = params[:materia]
          @studentsubject.save

INSERT INTO `students` (`name`, `lastname`, `tel1`, `tel2`, `street`, `numberhome`, `suburb`, `registrationnumber`, `banknumber`, `created_at`, `updated_at`, `discount`) VALUES ('Jorge Alejandro', 'Marcial Galvan', '123213', '123123', '1232', '123213', 'Centro', '123124', '123213', '2019-01-13 21:11:56', '2019-01-13 21:11:56', 10)
SELECT SUM(`debts`.`amount`) FROM `debts`
INSERT INTO "accounts" ("amount", "created_at", "updated_at", "student_id") VALUES (?, ?, ?, ?)  [["amount", -2000.0], ["created_at", "2018-10-11 06:20:04.443171"], ["updated_at", "2018-10-11 06:20:04.443171"], ["student_id", 7]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
        #Start
        #When register a new student
        #Save amount of account of student
        @account = Account.new
        @totaldebts = Debt.sum(:amount)
        @account.amount = @totaldebts
        @account.student_id = @student.id
        @account.save