app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT `subjects`.* FROM `subjects`

  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Matemáticas"], ["created_at", "2018-10-11 01:01:14.680220"], ["updated_at", "2018-10-11 01:01:14.680220"]]