app/views/accounts/_form.html.haml

        = text_field_tag :razon, "", class: "hidden"
        = select_tag 'amount_array[]', options_for_select(Debt.all.collect{ |u| [u.name, u.id]}),{class: "js-example-basic-single",multiple: "multiple", id: "select"}
---
SELECT `debts`.* FROM `debts`