app/views/accounts/compra.erb

SELECT  "debts".* FROM "debts" WHERE "debts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                    <tr>
                        <td><%=Debt.find(aquitoy.to_s).name %></td>